tutorials/tutorial_08/app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `description`, `created_at`, `updated_at`, `user_name`) VALUES ('', '', '2021-12-23 10:44:27', '2021-12-23 10:44:27', '')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save